__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
bi_directional_frame (InputLaye (None, 100, 1152)    0                                            
__________________________________________________________________________________________________
fc_1 (Dense)                    (None, 100, 2304)    2656512     bi_directional_frame[0][0]       
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 100, 2304)    42476544    fc_1[0][0]                       
__________________________________________________________________________________________________
merge_1 (Add)                   (None, 100, 2304)    0           fc_1[0][0]                       
                                                                 lstm_1[0][0]                     
__________________________________________________________________________________________________
fc_2 (Dense)                    (None, 100, 2304)    5310720     merge_1[0][0]                    
__________________________________________________________________________________________________
lstm_2 (LSTM)                   (None, 100, 2304)    42476544    fc_2[0][0]                       
__________________________________________________________________________________________________
merge_2 (Add)                   (None, 100, 2304)    0           fc_2[0][0]                       
                                                                 lstm_2[0][0]                     
__________________________________________________________________________________________________
fc_3 (Dense)                    (None, 100, 2304)    5310720     merge_2[0][0]                    
__________________________________________________________________________________________________
lstm_3 (LSTM)                   (None, 100, 2304)    42476544    fc_3[0][0]                       
__________________________________________________________________________________________________
merge_3 (Add)                   (None, 100, 2304)    0           fc_3[0][0]                       
                                                                 lstm_3[0][0]                     
__________________________________________________________________________________________________
fc_4 (Dense)                    (None, 100, 2304)    5310720     merge_3[0][0]                    
__________________________________________________________________________________________________
lstm_4 (LSTM)                   (None, 100, 2304)    42476544    fc_4[0][0]                       
__________________________________________________________________________________________________
global_max_pool (GlobalMaxPooli (None, 2304)         0           lstm_4[0][0]                     
__________________________________________________________________________________________________
fc_2048 (Dense)                 (None, 2048)         4720640     global_max_pool[0][0]            
__________________________________________________________________________________________________
output (Dense)                  (None, 3846)         7880454     fc_2048[0][0]                    
==================================================================================================
Total params: 201,095,942
Trainable params: 201,095,942
Non-trainable params: 0
__________________________________________________________________________________________________
