__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
nn_input_x1_audio (InputLayer)  (None, 128)          0                                            
__________________________________________________________________________________________________
nn_input_x2_rgb (InputLayer)    (None, 1024)         0                                            
__________________________________________________________________________________________________
nn_x_fc11 (Dense)               (None, 512)          66048       nn_input_x1_audio[0][0]          
__________________________________________________________________________________________________
nn_x_fc21 (Dense)               (None, 512)          524800      nn_input_x2_rgb[0][0]            
__________________________________________________________________________________________________
nn_x_fc12 (Dense)               (None, 1024)         525312      nn_x_fc11[0][0]                  
__________________________________________________________________________________________________
nn_x_fc22 (Dense)               (None, 1024)         525312      nn_x_fc21[0][0]                  
__________________________________________________________________________________________________
nn_x_fc13 (Dense)               (None, 4096)         4198400     nn_x_fc12[0][0]                  
__________________________________________________________________________________________________
nn_x_fc23 (Dense)               (None, 4096)         4198400     nn_x_fc22[0][0]                  
__________________________________________________________________________________________________
nn_x_fc14 (Dense)               (None, 8192)         33562624    nn_x_fc13[0][0]                  
__________________________________________________________________________________________________
nn_x_fc24 (Dense)               (None, 8192)         33562624    nn_x_fc23[0][0]                  
__________________________________________________________________________________________________
nn_x_fc15 (Dense)               (None, 4096)         33558528    nn_x_fc14[0][0]                  
__________________________________________________________________________________________________
nn_x_fc25 (Dense)               (None, 4096)         33558528    nn_x_fc24[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8192)         0           nn_x_fc15[0][0]                  
                                                                 nn_x_fc25[0][0]                  
__________________________________________________________________________________________________
nn_fc_3 (Dense)                 (None, 4096)         33558528    concatenate_1[0][0]              
__________________________________________________________________________________________________
nn_output (Dense)               (None, 3846)         15757062    nn_fc_3[0][0]                    
==================================================================================================
Total params: 193,596,166
Trainable params: 193,596,166
Non-trainable params: 0
__________________________________________________________________________________________________
