__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
stream_nn_x1_audio (InputLayer) (None, 100, 128)     0                                            
__________________________________________________________________________________________________
stream_nn_x2_rgb_video (InputLa (None, 100, 1024)    0                                            
__________________________________________________________________________________________________
fc_1_x1 (Dense)                 (None, 100, 512)     66048       stream_nn_x1_audio[0][0]         
__________________________________________________________________________________________________
fc_1_x2 (Dense)                 (None, 100, 512)     524800      stream_nn_x2_rgb_video[0][0]     
__________________________________________________________________________________________________
neauralN_1_audio (InputLayer)   (None, 128)          0                                            
__________________________________________________________________________________________________
neauralN_2_video (InputLayer)   (None, 1024)         0                                            
__________________________________________________________________________________________________
lstm_1_x1 (LSTM)                (None, 100, 128)     328192      fc_1_x1[0][0]                    
__________________________________________________________________________________________________
lstm_1_x2 (LSTM)                (None, 100, 1024)    6295552     fc_1_x2[0][0]                    
__________________________________________________________________________________________________
nn_fc_11 (Dense)                (None, 512)          66048       neauralN_1_audio[0][0]           
__________________________________________________________________________________________________
nn_fc_21 (Dense)                (None, 512)          524800      neauralN_2_video[0][0]           
__________________________________________________________________________________________________
lstm_2_x1 (LSTM)                (None, 100, 128)     131584      lstm_1_x1[0][0]                  
__________________________________________________________________________________________________
lstm_2_x2 (LSTM)                (None, 100, 1024)    8392704     lstm_1_x2[0][0]                  
__________________________________________________________________________________________________
nn_fc_12 (Dense)                (None, 1024)         525312      nn_fc_11[0][0]                   
__________________________________________________________________________________________________
nn_fc_22 (Dense)                (None, 1024)         525312      nn_fc_21[0][0]                   
__________________________________________________________________________________________________
dropout_1_x1 (Dropout)          (None, 100, 128)     0           lstm_2_x1[0][0]                  
__________________________________________________________________________________________________
dropout_1_x2 (Dropout)          (None, 100, 1024)    0           lstm_2_x2[0][0]                  
__________________________________________________________________________________________________
nn_fc_13 (Dense)                (None, 4096)         4198400     nn_fc_12[0][0]                   
__________________________________________________________________________________________________
nn_fc_23 (Dense)                (None, 4096)         4198400     nn_fc_22[0][0]                   
__________________________________________________________________________________________________
fc_2_x1 (Dense)                 (None, 100, 1)       129         dropout_1_x1[0][0]               
__________________________________________________________________________________________________
fc_2_x2 (Dense)                 (None, 100, 1)       1025        dropout_1_x2[0][0]               
__________________________________________________________________________________________________
nn_fc_14 (Dense)                (None, 8192)         33562624    nn_fc_13[0][0]                   
__________________________________________________________________________________________________
nn_fc_24 (Dense)                (None, 8192)         33562624    nn_fc_23[0][0]                   
__________________________________________________________________________________________________
pool_1_x1 (GlobalMaxPooling1D)  (None, 1)            0           fc_2_x1[0][0]                    
__________________________________________________________________________________________________
pool_1_x2 (GlobalMaxPooling1D)  (None, 1)            0           fc_2_x2[0][0]                    
__________________________________________________________________________________________________
nn_fc_15 (Dense)                (None, 4096)         33558528    nn_fc_14[0][0]                   
__________________________________________________________________________________________________
nn_fc_25 (Dense)                (None, 4096)         33558528    nn_fc_24[0][0]                   
__________________________________________________________________________________________________
stream_fc_1 (Dense)             (None, 8192)         16384       pool_1_x1[0][0]                  
__________________________________________________________________________________________________
stream_fc_2 (Dense)             (None, 8192)         16384       pool_1_x2[0][0]                  
__________________________________________________________________________________________________
nn_output_1 (Dense)             (None, 3846)         15757062    nn_fc_15[0][0]                   
__________________________________________________________________________________________________
nn_output_2 (Dense)             (None, 3846)         15757062    nn_fc_25[0][0]                   
__________________________________________________________________________________________________
stream_output_1 (Dense)         (None, 3846)         31510278    stream_fc_1[0][0]                
__________________________________________________________________________________________________
stream_output_2 (Dense)         (None, 3846)         31510278    stream_fc_2[0][0]                
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 15384)        0           nn_output_1[0][0]                
                                                                 nn_output_2[0][0]                
                                                                 stream_output_1[0][0]            
                                                                 stream_output_2[0][0]            
__________________________________________________________________________________________________
nn_stream_lstm_fc_2 (Dense)     (None, 8192)         126033920   concatenate_2[0][0]              
__________________________________________________________________________________________________
nn_stream_lstm_fc_3 (Dense)     (None, 4096)         33558528    nn_stream_lstm_fc_2[0][0]        
__________________________________________________________________________________________________
nn_stream_lstm_output (Dense)   (None, 3846)         15757062    nn_stream_lstm_fc_3[0][0]        
==================================================================================================
Total params: 429,937,568
Trainable params: 429,937,568
Non-trainable params: 0
__________________________________________________________________________________________________
