__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
audio (InputLayer)              (None, 100, 128)     0                                            
__________________________________________________________________________________________________
rgb_video (InputLayer)          (None, 100, 1024)    0                                            
__________________________________________________________________________________________________
fc_1_x1 (Dense)                 (None, 100, 512)     66048       audio[0][0]                      
__________________________________________________________________________________________________
fc_1_x2 (Dense)                 (None, 100, 512)     524800      rgb_video[0][0]                  
__________________________________________________________________________________________________
lstm_1_x1 (LSTM)                (None, 100, 128)     328192      fc_1_x1[0][0]                    
__________________________________________________________________________________________________
lstm_1_x2 (LSTM)                (None, 100, 1024)    6295552     fc_1_x2[0][0]                    
__________________________________________________________________________________________________
lstm_2_x1 (LSTM)                (None, 100, 128)     131584      lstm_1_x1[0][0]                  
__________________________________________________________________________________________________
lstm_2_x2 (LSTM)                (None, 100, 1024)    8392704     lstm_1_x2[0][0]                  
__________________________________________________________________________________________________
dropout_1_x1 (Dropout)          (None, 100, 128)     0           lstm_2_x1[0][0]                  
__________________________________________________________________________________________________
dropout_1_x2 (Dropout)          (None, 100, 1024)    0           lstm_2_x2[0][0]                  
__________________________________________________________________________________________________
stream_fc_3_x1 (Dense)          (None, 100, 16)      2064        dropout_1_x1[0][0]               
__________________________________________________________________________________________________
stream_fc_3_x2 (Dense)          (None, 100, 16)      16400       dropout_1_x2[0][0]               
__________________________________________________________________________________________________
pool_1_x1 (GlobalMaxPooling1D)  (None, 16)           0           stream_fc_3_x1[0][0]             
__________________________________________________________________________________________________
pool_1_x2 (GlobalMaxPooling1D)  (None, 16)           0           stream_fc_3_x2[0][0]             
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32)           0           pool_1_x1[0][0]                  
                                                                 pool_1_x2[0][0]                  
__________________________________________________________________________________________________
fc_2 (Dense)                    (None, 8192)         270336      concatenate_1[0][0]              
__________________________________________________________________________________________________
fc_3 (Dense)                    (None, 4096)         33558528    fc_2[0][0]                       
__________________________________________________________________________________________________
output (Dense)                  (None, 3846)         15757062    fc_3[0][0]                       
==================================================================================================
Total params: 65,343,270
Trainable params: 65,343,270
Non-trainable params: 0
__________________________________________________________________________________________________
